In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.read_csv('../csv-data/scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [5]:
df['Age'][df['Age'] > 50] #df[df['Age'] > 50]['Age']동일!

1    61
2    90
3    66
4    56
7    77
Name: Age, dtype: int64

In [8]:
df.loc[0,'Age'] = np.nan

In [9]:
df

                   Name        Born        Died   Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   NaN             Chemist
1        William Gosset  1876-06-13  1937-10-16  61.0        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13  90.0               Nurse
3           Marie Curie  1867-11-07  1934-07-04  66.0             Chemist
4         Rachel Carson  1907-05-27  1964-04-14  56.0           Biologist
5             John Snow  1813-03-15  1858-06-16  45.0           Physician
6           Alan Turing  1912-06-23  1954-06-07  41.0  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  77.0       Mathematician

In [11]:
df['Age'].isna()

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: Age, dtype: bool

In [12]:
df['Age'].fillna('0')

0       0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
Name: Age, dtype: object

In [14]:
df['Age'] = df['Age'].fillna('0')
df['Age']

0       0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
Name: Age, dtype: object

In [15]:
df.drop(index=0, inplace=True)
df

                   Name        Born        Died   Age          Occupation
1        William Gosset  1876-06-13  1937-10-16  61.0        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13  90.0               Nurse
3           Marie Curie  1867-11-07  1934-07-04  66.0             Chemist
4         Rachel Carson  1907-05-27  1964-04-14  56.0           Biologist
5             John Snow  1813-03-15  1858-06-16  45.0           Physician
6           Alan Turing  1912-06-23  1954-06-07  41.0  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23  77.0       Mathematician

In [18]:
df.reset_index(inplace=True)
df

,level_0,index,Name,Born,Died,Age,Occupation
0,0,1,William Gosset,1876-06-13,1937-10-16,61.0,Statistician
1,1,2,Florence Nightingale,1820-05-12,1910-08-13,90.0,Nurse
2,2,3,Marie Curie,1867-11-07,1934-07-04,66.0,Chemist
3,3,4,Rachel Carson,1907-05-27,1964-04-14,56.0,Biologist
4,4,5,John Snow,1813-03-15,1858-06-16,45.0,Physician
5,5,6,Alan Turing,1912-06-23,1954-06-07,41.0,Computer Scientist
6,6,7,Johann Gauss,1777-04-30,1855-02-23,77.0,Mathematician

In [20]:
df.drop(columns='level_0', inplace=True)

In [22]:
df.drop(columns='index', inplace=True)

In [23]:
df

                   Name        Born        Died   Age          Occupation
0        William Gosset  1876-06-13  1937-10-16  61.0        Statistician
1  Florence Nightingale  1820-05-12  1910-08-13  90.0               Nurse
2           Marie Curie  1867-11-07  1934-07-04  66.0             Chemist
3         Rachel Carson  1907-05-27  1964-04-14  56.0           Biologist
4             John Snow  1813-03-15  1858-06-16  45.0           Physician
5           Alan Turing  1912-06-23  1954-06-07  41.0  Computer Scientist
6          Johann Gauss  1777-04-30  1855-02-23  77.0       Mathematician

In [24]:
print('the end')

the end